{"meta":{"title":"猪猪侠","subtitle":"做一只想飞的猪","description":"一个猪窝","author":"Jiaxi Zhang","url":"https://shen-yu.gitee.io","root":"/"},"pages":[{"title":"friends","date":"2020-03-06T12:46:23.000Z","updated":"2020-03-06T12:46:23.862Z","comments":true,"path":"friends/index.html","permalink":"https://shen-yu.gitee.io/friends/index.html","excerpt":"","text":""},{"title":"tags","date":"2020-03-06T12:46:12.000Z","updated":"2020-03-06T12:59:06.971Z","comments":true,"path":"tags/index.html","permalink":"https://shen-yu.gitee.io/tags/index.html","excerpt":"","text":""},{"title":"categories","date":"2020-03-06T12:46:38.000Z","updated":"2020-03-06T12:58:13.714Z","comments":true,"path":"categories/index.html","permalink":"https://shen-yu.gitee.io/categories/index.html","excerpt":"","text":""},{"title":"about","date":"2020-03-06T12:45:58.000Z","updated":"2020-03-07T07:08:31.272Z","comments":true,"path":"about/index.html","permalink":"https://shen-yu.gitee.io/about/index.html","excerpt":"","text":"A Coder, Live in Hangzhou, China 姓名：张嘉喜现居：杭州github：omgggboyQQ：171496079微信：m171496079————————————————————————————浙江大学软件工程硕士在读，硕士一年级。目前在浙江大学计算机辅助设计与图形学(cad&amp;cg)国家重点实验室主要研究数据可视化java初学，qml入门 博客拿来记录学习和分享生活，欢迎交流"}],"posts":[{"title":"什么是死锁？在什么情况下产生？怎么解决？","slug":"deadlock","date":"2020-07-06T15:12:11.229Z","updated":"2020-07-06T15:12:11.230Z","comments":true,"path":"2020/ckcl684zf00095j9k8mezd105/","link":"","permalink":"https://shen-yu.gitee.io/2020/ckcl684zf00095j9k8mezd105/","excerpt":"","text":"在多道程序环境中，多个进程可以竞争有限数量的资源。当一个进程申请资源时，如果这时没有可用资源，那么这个进程进入等待状态。有时，如果所申请的资源被其他等待进程占有，那么等待进程有可能再也无法改变状态。这种情况称为死锁（deadlock）。 死锁的必要条件：如果在一个系统中以下四个条件同时成立，那么就能引起死锁： 互斥（ mutual exclusion）：至少一个资源必须处于非共享模式，即一次只有一个进程可使用。如果另一进程申请该资源，那么申请进程应等到该资源释放为止。 占有并等待（ hold and wait ）：一个进程应占有至少一个资源，并等待另一个资源，该资源为其他进程所占有。 非抢占（ no preemption ）：资源不能被抢占，即资源只能被进程完成任务后自愿释放。 循环等待（ circular wait ）：有一组等待进程{P0,P1,···，Pn},P0等待的资源为P1占有，P1等待的资源为P2占有，·······，P（n-1）等待的资源为Pn占有，Pn等待的资源被P0占有。 四个条件必须同时成立才会出现死锁。循环等待条件意味着占有并等待条件，这样四个条件并不完全独立。 一般来说，处理死锁问题有三种方法： 通过协议来预防和避免死锁，确保系统不进入死锁状态。 可以允许系统进入死锁状态，然后检测它，并加以恢复。 可以忽视这个问题，认为死锁不可能在系统内发生。 第三种解决为大多数操作系统所采用，包括Linux和windows。因此应用程序开发人员需要自己编写程序，以便处理死锁。 死锁预防 死锁避免 死锁检测 死锁恢复。","categories":[],"tags":[]},{"title":"字节跳动秋招提前批c++客户端一面","slug":"interview_ByteDance","date":"2020-07-06T14:42:30.477Z","updated":"2020-07-06T15:04:23.534Z","comments":true,"path":"2020/ckcl684zb00045j9k6104ccqi/","link":"","permalink":"https://shen-yu.gitee.io/2020/ckcl684zb00045j9k6104ccqi/","excerpt":"","text":"内心独白算是第一次正式的视频面试，还是很紧张……( ´▽｀)； 过程总结 简短的自我介绍 询问项目相关 QML和QWeight比较，当初项目为什么选用这个 OpenGL版本 QT的信号与槽， 可以用什么代替 进程间通信方式，线程间通信方式 c++面向对象的三个特性具体解释一下 关于一段代码的虚函数调用后结果 关于虚函数表的问题 反思感觉对于图形学实际学习还存在欠缺，对于操作系统和C++语言深入了解不够细致，只是懂个大概，实际应用能力还有待增长。QT相关的应用也应该更加深入了解。查漏补缺吧。对于一面提及到的知识点回去好好温习巩固一下。只是提前批的第一波，不知道后面的公司有没有音讯，继续学习。期待能有二面吧，目前还是很想去字节上班的。","categories":[],"tags":[]},{"title":"动态库与静态库的区别","slug":"libvdll","date":"2020-06-23T14:11:27.372Z","updated":"2020-06-23T14:11:42.944Z","comments":true,"path":"2020/ckcl684zg000a5j9kabvu92ki/","link":"","permalink":"https://shen-yu.gitee.io/2020/ckcl684zg000a5j9kabvu92ki/","excerpt":"","text":"区别：静态库和动态库最本质的区别就是：该库是否被编译进目标（程序）内部。 静态（函数）库一般拓展名为（.a或者.lib),这类的函数库通常拓展名为libxxx.a或者xxx.lib。这类库在编译的时候会直接整合到目标程序中，所以利用静态函数库编译程的文件会比较大，这类函数库最大的优点就是编译成功的可执行文件可以独立运行，而不再需要向外部要求读取函数库的内容；但是从升级难易度来看明显没有优势，如果函数库更新，需要重新编译。 动态函数库动态函数库的拓展名一般为 （.so或.dll)，这类函数库通常名为libxxx.so或xxx.dll。与静态函数库被整个捕捉到程序中不同，动态函数库在编译的时候，在程序中只有一个“指向”的位置而已，也就是说当可执行文件需要使用到函数库的机制时，程序才会去读取函数库来使用；也就是说可执行文件无法单独运行。这样从产品功能升级角度方便升级，只要替换对应动态库即可，不必重新编译整个可执行文件。 总结 从产品化的角度，发布的算法库和功能库尽量使用动态库，这样方便更新和升级，不必重新编译整个可执行文件，只需新版本动态库替换掉旧动态库即可。 从函数库集成的角度，若要将发布的所有子库（不止一个）集成成一个动态库向外提供接口，那么就需要将所有子库编译为静态库，这样所有子库就可以全部编译进目标动态库中，由最终的一个集成库向外提供功能。","categories":[],"tags":[]},{"title":"虚函数","slug":"virtual","date":"2020-06-20T10:22:26.698Z","updated":"2020-06-20T10:26:10.672Z","comments":true,"path":"2020/ckcl684zj000d5j9k9e31dc6b/","link":"","permalink":"https://shen-yu.gitee.io/2020/ckcl684zj000d5j9k9e31dc6b/","excerpt":"","text":"定义在c++中，基类必须指出派生类重定义哪些函数，定义为virtual的函数是基类期待派生类重新定义的，基类希望派生类继承的函数不能定义为虚函数。（c++ primer） 动态绑定在C++中，通过基类的引用（或指针）调用虚函数时，发生动态绑定。引用（或指针）即可以指向基类对象也可以指向派生类对象，这一事实是动态绑定的关键。用引用（或指针）调用虚函数在运行时确定，被调用的函数是引用（或指针）所指对象的实际类型所定义的。 保留字virtual的目的是启用动态绑定。成员默认是非虚函数，对非虚函数的调用在编译时确定。为了指明函数为虚函数，在其返回类型类型前面加上保留字virtual。除了构造函数外，任何非static成员函数都可以是虚函数。保留字virtual只能在类内部的成员函数声明中出现，不能在类定义体外部出现的函数定义上。 派生类与虚函数尽管不是必须这么做，派生类一般会重定义所继承的虚函数。如果派生类没有重定义某个虚函数，则使用基类中定义的版本。派生类必须对想要重定义的每个继承成员进行声明。派生类中虚函数的声明必须与基类中的定义方式完全匹配，但有一个例外：返回对基类型的引用（或指针）的虚函数。派生类中的虚函数可以返回基类函数所返回类型的派生类的引用（或指针）。 tips：一旦函数在基类中声明为虚函数，他就一直为虚函数，派生类无法改变该函数为虚函数这一事实。派生类重定义虚函数时，可以使用virtual保留字，但不是必须这么做。 覆盖虚函数机制在某些情况下，希望覆盖虚函数机制并强制函数调用使用虚函数的特定版本，这时可以用作用域操作符： 123Item_base *baseP &#x3D; &amp;derived;&#x2F;&#x2F; calls version from the base class regardless of the dynamic type of basePdouble d &#x3D; baseP -&gt; Item_base::net_prise(42); 这段代码强制将net_price调用确定为Item_base中定义的版本，该调用将在编译时确定。为什么会希望覆盖虚函数机制？最常见的理由是为了派生类虚函数调用基类中的版本。在这种情况下，基类版本可以完成继承层次中所有类型的公共任务，而每个派生类型只添加自己的特殊工作。 tips：派生类虚函数调用基类版本时，必须显式使用作用域操作符。如果派生类忽略这样做，则函数调用会在运行时确定并且将是一个自身调用，从而导致无穷递归。 虚函数与默认实参像其他任何函数一样，虚函数也可以有默认实参值，该值将在编译时确定。如果一个调用省略了具有默认值的实参，则所用的值由调用该函数类型定义，与对象的动态类型无关。通过基类的引用或指针调用虚函数时，默认实参为在基类虚函数声明中指定的值，如果通过派生类的指针或引用调用虚函数，则默认实参是在派生类版本中声明的值。 在同一虚函数的基类版本和派生类版本中使用不同的默认实参几乎一定会引起麻烦。如果通过基类的引用或指针调用虚函数，但实际执行的是派生类中定义的版本，这时就可能会出现问题。在这种情况下，为虚函数的基类版本定义的默认实参将传给派生类定义的版本，而派生类版本是用不同的默认实参定义的。 c++的多态性引用和指针的静态类型和动态类型可以不同，这是C++用以支持多态性的基石。 通过基类引用或指针调用基类中定义的函数时，我们并不知道执行函数的对象的确切类型，执行函数的对象可能是基类类型的，也可能是派生类型的。 如果调用非虚函数，则无论实际对象是什么类型，都执行基类类型所定义的函数。如果调用虚函数，则直到运行时才能确定调用哪个函数，运行的虚函数是引用所绑定的或指针所指向的对象所属类型定义的版本。 虚析构函数自动调用基类部分的析构函数对基类的设计有重要影响。 删除指向动态分配对象的指针时，需要运行析构函数在释放对象的内存之前清理对象。处理继承层次中的对象时，指针的静态类型可能与删除对象的动态类型不同，可能会删除实际指向派生类对象的基类类型指针。 如果删除基类指针，则需要运行基类析构函数并清除基类的成员，如果对象实际时派生类型的，则没有定义该行为。要保证运行适当的析构函数，基类中的析构函数必须为虚函数： 12345class Item_base &#123;public: &#x2F;&#x2F; no work,but virtual destructor needed &#x2F;&#x2F; if base pointer that points to a derived object is ever deleted virtual ~Item_base() &#123; &#125; 如果析构函数为虚函数，那么通过指针调用时，运行哪个析构函数将因指针所指对象类型的不同而不同： 1234Item_base *itemP &#x3D; new Item_base; &#x2F;&#x2F; same static and dymatic type delete item; &#x2F;&#x2F; ok:destructor for Item_base calleditemP &#x3D; new Bulk_item; &#x2F;&#x2F; ok:static and dynamic types differdelete itemP; &#x2F;&#x2F; ok:destructor for Bulk_item called 像其他虚函数一样，析构函数的性质都将继承。因此，如果层次中根类的析构函数也虚函数，则派生类析构函数也将是虚函数，无论派生类显式定义析构函数还是使用合成析构函数，派生类析构函数都是虚函数。 基类虚构函数式三法则的一个重要例外。三法则指出，如果类需要析构函数，则类几乎也确实需要其他复制控制成员，基类几乎总是需要析构函数，从而可以将析构函数设定为虚函数。如果基类为了将析构函数设为虚函数而具有空析构函数，那么，类具有析构函数并不表示需要赋值操作符或复制构造函数。 tips：即使析构函数没有工作要做，继承层次的根类也应该定义一个虚析构函数。 构造函数和复制操作符不是虚函数在复制控制成员中， 只有析构函数应定义为虚函数，构造函数不能定义为虚函数。构造函数是对对象完全构造之前运行的，在构造函数运行的时候，对象的动态类型还不完整。 虽然可以在基类中将对象成员函数 operator=定义为虚函数，但这样做并不影响派生类中使用的复制操作符。每个类有自己的赋值操作符，派生类中的赋值操作符有一个与类本身类型相同的形参，该类型必须不同于继承层次中任何其他类的赋值操作符的形参类型。 将赋值操作符设为虚函数可能会令人混淆，因为虚函数必须在基类和派生类中具有相同的形参。基类赋值操作符有一个形参是自身类类型的引用，如果该操作符为虚函数，则每个类型都将得到一个虚函数成员，该成员定义了参数为一个基类对象的operator=。但是，对派生类而言，这个操作符与赋值操作符是不同的。 tips：将类的赋值操作符定义为虚函数很可能令人混淆，而且没什么用处。 构造函数和析构函数中的虚函数构造派生类对象时首先运行基类构造函数初始化对象的基类部分。在执行基类构造函数时，对象的派生类部分是未初始化的。实际上，此时对象还不是一个派生类对象。 撤销派生类对象时，首先撤销它的派生类部分，然后按照与构造顺序的逆序撤销它的基类部分。 在这两种情况下，运行构造函数或析构函数的时候，对象都是不完整的。为了适应这种不完整，编译器将对象的类型视为在构造或析构期间发生了变化。在基类构造函数或析构函数中，将派生类对象作为基类类型对象对待。 构造或析构期间的对象类型对虚函数的绑定有影响。 tips：如果在构造函数或析构函数中调用虚函数，则运行的是为构造函数或析构函数自身类型定义的版本。 无论由构造函数（或析构函数）直接调用虚函数，或者从构造函数（或虚构函数）所调用的函数间接调用虚函数，都应用这种绑定。 要理解这种行为，考虑如果从基类构造函数（或析构函数）调用虚函数的派生类版本会怎样。虚函数的派生类版本很可能会访问派生类对象的成员，毕竟，如果派生类版本不需要使用派生类对象的成员，派生类多半能够使用基类中的定义。但是，对象的派生部分的成员不会在基类构造函数运行期间初始化，实际上，如果允许这样的访问，程序很可能会崩溃。","categories":[],"tags":[]},{"title":"new与malloc的区别","slug":"new_and_malloc","date":"2020-06-18T16:15:16.710Z","updated":"2020-06-18T16:16:47.994Z","comments":true,"path":"2020/ckcl684zi000c5j9k1q2w0xzy/","link":"","permalink":"https://shen-yu.gitee.io/2020/ckcl684zi000c5j9k1q2w0xzy/","excerpt":"","text":"1. molloc与free是C++/c语言的标准函数， new/delete是c++的运算符。2.他们都可以用于申请动态内存和释放内存。new/delete比molloc/free更加智能，其实底层也是执行的malloc/free。为啥说new/delete更加的智能？因为new和delete在对象创建的时候自动执行构造函数，对象消亡之前会自动执行析构函数。既然new/delete的功能完全覆盖了malloc和free， 为什么c++中不把malloc/free淘汰出局呢？因为c++程序经常要调用c语言，而c语言只能用malloc/free管理动态内存。3. new返回指定类型的指针，并且可以自动计算出所需要的大小。malloc必须用户指定大小，并且默认返回类型为void*， 必须强制转换为实际类型的指针。","categories":[],"tags":[]},{"title":"进程和线程","slug":"process","date":"2020-06-17T04:20:38.388Z","updated":"2020-07-06T15:05:06.785Z","comments":true,"path":"2020/ckcl684zh000b5j9k5fc34z3s/","link":"","permalink":"https://shen-yu.gitee.io/2020/ckcl684zh000b5j9k5fc34z3s/","excerpt":"","text":"什么是进程 进程是正在运行的一个应用程序，程序一旦运行就是进程。 进程是系统进行资源分配的最小单位，每个进程拥有独立的地址空间。 一个进程无法直接去访问另外一个进程的变量和数据结构，需要进行进程间通信，包括管程，消息队列。 线程是进程的一个实体，是资源调度的基本单位。 进程与线程的区别 同一进程的线程共享进程的地址空间，而进程之间则是独立的地址空间 同一进程内的线程共享本进程的资源，但是进程之间的资源是独立的 一个进程崩溃后，在保护模式下不会对其他进程产生影响，但是一个线程崩溃后，整个进程崩溃 进程切换，消耗资源大，线程切换时间少于进程 二者均可以并发执行","categories":[],"tags":[]},{"title":"java的基本程序设计结构","slug":"javav1ch03","date":"2020-03-18T14:01:21.375Z","updated":"2020-03-19T01:21:13.398Z","comments":true,"path":"2020/ckcl684z900025j9kdsw7dora/","link":"","permalink":"https://shen-yu.gitee.io/2020/ckcl684z900025j9kdsw7dora/","excerpt":"","text":"最简单的Java程序 java区分大小写 java应用程序的全部内容必须放置在类中 每个句子由分号结尾，回车不是句子的结尾 注释 单行注释// 多行注释/* */ 自动生成文档/** */ 基本数据类型整形 int 4字节 short 2字节 long 8字节 byte 1字节 浮点型 float 4字节 double 8字节 char类型 常用字符采用单字节编码，，而另一些字符而需要两个或者更多个字节。在Java中采用UTF-16所以占用2字节 boolean（布尔）类型 1位 只有0和1 1字节 1字节是计算机处理最小单位 4字节 java虚拟机规范里规定 变量 命名允许字符，数字和字母。字母包括’A’ ~ ‘Z’、 ‘a’ ~ ‘z’、’_’、’$’或者某种语言中表示字母的任何Unicode字符。数字包括’0’ ~ ‘9’和某种语言中表示数字的任何Unicode字符。 利用关键字final指示常量 声明一个变量后，必须用赋值语句对变量进行显式初始化，千万不要使用未初始化对变量 运算符 各运算符的优先级 各数据类型之间的强制类型转换 字符串 字符串的不可变属性 字符串类的一些常用接口 输入与输出 读取输入 格式化输出 文件的输入与输出 流程控制 if else while do while for break 提供了带标签选项 switch continue 提供了带标签选项 大数值 满足更高精度要求的计算 运算需要使用类内方法 数组 for each 数据变量是一种引用 多维数组 不规则数组 XMind: ZEN - Trial Version","categories":[],"tags":[]},{"title":"数据链路层","slug":"Data-Link-Layer","date":"2020-03-08T12:28:52.720Z","updated":"2020-03-08T12:28:52.720Z","comments":true,"path":"2020/ckcl684zd00065j9kaxx63bmo/","link":"","permalink":"https://shen-yu.gitee.io/2020/ckcl684zd00065j9kaxx63bmo/","excerpt":"","text":"使用点对点信道的数据链路层点对点信道的数据链路层在进行通信时的主要步骤如下 1.结点A的数据链路层把网络层交下来的IP数据报添加首部和尾部封装成帧 2.结点A把封装好的帧发生发生给结点B的数据链路层 3.若结点B的数据链路层收到的帧无差错，则从收到的帧中提取 出IP数据报交给上面的网络层；否则丢弃这个帧 三个基本问题 封装成帧 在一段数据的前后分布添加首部和尾部，这样就构成了一个帧 MTU(Maximum Transfer Unit)最大传送单元是指帧的数据部分长度上限,默认值1500字节 透明传输 “透明”表示某一个实际存在的事物看起来却好像不存在。这些数据就“看不见”数据链路层有什么防碍数据传输的东西。 为解决透明传输问题，发送端的数据链路层在出现控制字符“SOH”和“EOT”之前加入转义字符“ESC”，在接收端的数据链路层把数据运往网络层之前删除这些之前插入的转义字符。这种方法叫字节填充或字符填充。 差错检测 误码率 在一段时间内，传输错误的比特占所传输比特总数的比率 循环冗余检测CRC(Cyclic Redundancy Check) 在每组数据后面增加n位冗余码供差错检测 帧检验序列FCS(Frame Check Sequence) CRC是一种检错方法，而FSC是添加在数据后面的冗余码，在检错方法上可以选用CRC，但也可以不选用CRC 数据链路层若仅仅使用CRC差错检测技术，则只能做到对帧但无差错接收 传输差错 比特差错 比特在传输过程中可能会产生差错，1变0，0变1 没有比特差错 帧丢失 帧重复 帧失序 对于通信质量较差但无线传输链路，数据链路层协议使用确认和重传机制，数据链路层向上提供可靠传输的服务 点对点协议PPP(Point -to-Point Protocol)特点 应该满足的需求 简单 封装成帧 透明性 多种网络层协议 多种类型链路 差错检测 检测连接状态 最大传送单元 网络层地址协商 数据压缩协商 组成 一个将IP数据报封装到串行链路的方法。PPP既支持异步链路（无奇偶检验的8比特数据），也支持面向比特的同步链路。IP数据报在PPP帧中就是信息部分。这个信息部分长度受最大传送单元MTU限制 一个用来建立、配置和测试数据链路连接的链路控制协议LCP(Link Control Protocol)。通信双方可以协商一些选项。在RFC 1661中定义了11种类型的LCP分组 一套网络控制协议NCP(Network Control Protocol),其中的每个协议支持不同的网络层协议，如IP、OSI的网络层、DECnet、以及AppleTalk等。 帧格式 各字段意义 首部的第一个字段和尾部的第二个字段F(Flag),规定为0x7E 首部中的字段A规定为0xFF，控制字段C规定为0x03。最初考虑以后再对这两个字段的值进行定义，但自今也没有给出。 PPP首部的第四个字段是2字节的协议字段。当协议字段为0x0021时，PPP帧的信息字段就是IP数据报。若为0xC021，则信息字段是PPP链路控制协议LCP的数据，而0x8021表示网络层的控制数据。 信息字段的长度是可变的，不超过1500字节 尾部中的第一个字段(2字节)是使用CRC的帧检验序列FCS 字节填充 当PPP使用异步传输时，他把转义符定义为0x7D，并使用字节填充 把信息字段中出现的每一个0x7E字节转变为2字节序列(0x7D,0x5E) 若信息字段中出现一个0x7D的字节(即出现了和转义字符一样的比特组合），则把0x7D转变为2字节序列(0x7D,0x5D) 若信息字段中出现ASCII码的控制符（即树枝小于0x20的字符），则在字符前面加上一个0x7D字节，同时把该字符的编码加以改变。例如，出现0x03就把它转变为2字节序列(0x7D,0x23) 零比特填充 PPP协议用在SONET/SDH链路时，使用同步传输（一连串的比特连续传送）而不是异步传输（逐个字符地传送） 在发送端，先扫描整个信息字段（通常用硬件实现，但也是可用软件实现，只是会慢些）。只要发现有5个连续1，则立即填入一个0.因此经过这个零比特填充后的数据，就可以保证在信息字段不会出现6个连续1。接收端在收到一个帧时，先找到标志字段F以确定一个帧的边界，接着再用硬件对其中的比特流进行扫描。每当发现5个连续1时，就把这5个连续1后的0删除，以还原成原来的信息比特流 工作状态 当用户拨号接入ISP后，就建立一条从用户个人电脑到ISP的物理连接。这时，用户个人电脑向ISP发送一系列的链路控制协议LCP分组（封装成多个PPP帧），以便建立LCP连接。这些分组以及其响应选择了将要使用的一些PPP参数。接着还要进行网络层配置，网络控制协议NCP给新接入的用户个人电脑分配一些临时的IP地址。这样，用户个人电脑就称为互联网上的一个有IP地址的主机了 使用广播信道的数据链路层局域网的数据链路层 局域网的优点 具有广播功能，从一个站点可很方便地访问全网。局域网上的主机可共享连接在局域网上的各种硬件和软件资源 便于系统的扩展和逐渐演变，各设备的位置可灵活调节和改变 提高了系统的可靠性、可用性和生存性 局域网按网络拓扑分类 星形网 环形网 总线网 共享信道技术上的两种方法 静态划分信道 频分复用、时分复用、波分复用和码分复用等，用户只要分配到了信道就不会和其他用户发送冲突。但这种方法代价较高，不适合局域网使用 动态媒体接入控制 随机接入 随机接入的特点是所有的用户可随机地发送信息。但如果恰巧有两个或更多但用户在同一时刻发送信息，那么在共享媒体上就要产生碰撞（即发送了冲突），使得这些用户但发送都失败。因此，必须有解决碰撞的网络协议。 受控接入 受控接入的特点是用户不能随机地发送信息而必须服从一定的控制。这类的典型代表有分散控制的令牌环局域网和集中控制的多点线路探询（polling），或称为轮询。 IEEE802委员会曾把局域网的数据链路层拆成两个子层，即逻辑链路控制（LLC）子层（与传输媒体无关）和媒体接入控制子层（MAC）子层（与传输媒体有关）。但现在LLC子层已成历史。MAC（Medium Access Control）LLC（Logical Link Control） 计算机与外界局域网的通信要通过通信适配器（或网络适配器），它又称为网络接口卡或网卡。计算机的硬件地址就在适配器的ROM中 CSMA/CD协议 协议要点 多点接入 说明这是总线型网络，许多计算机以多点接入的方式连接在一个总线上 载波监听 载波监听就是检测信道。不管发送前，还是发送中，每个站都必须不停地检测信道 碰撞检测 就是“便发送边监听”，即适配器边发送数据边检测信道上的信号电压的变化情况，以便判断自己在发送数据时其他站是否也在发送数据 总结 准备发送 适配器从网络层获得一个分组，加上以太网的首部和尾部，以组成以太网帧，放入适配器的缓存中。但是发送之前，必须先检测信道 检测信道 若检测到信道忙，则应不停地检测，一直等待信道转为空闲。若检测到信道空闲，并在96比特时间内信道保持空闲（保证了帧间最小间隔），就发送这个帧。 在发送过程中仍不停地检测信道，即网络适配器要边发送边监听 发送成功：争用期内一直为检测到碰撞。这个帧肯定能够发送成功。发送完毕后，其他什么也不做。然后回到准备发送的状态。 发送失败：在争用期内检测到碰撞。这时立即停止发送数据，并按规定发送人为干扰信号。适配器接着执行指数退避算法，等待r倍512比特时间后，返回到检测信道。但若重传达16次仍不成功，则停止重传而向上报错 集线器 使用集线器物理上是星型网实际，在逻辑上仍然是一个总线网，各站使用的还是CSMA/CD协议 集线器有很多接口，很像一个多接口的转发器 集线器工作在物理层，工作只是简单地转发，不进行碰撞检测 集线器采用了专门的芯片，进行自适应串音回波抵消 以太网的MAC层（medium access control） MAC层的硬件地址 硬件地址又称为物理地址或MAC地址 MAC地址固化在适配器的ROM中 MAC帧的格式 第一个字段：6字节长的目的地址 第二个字段：6字节长的源地址 第三个字段：2字节长的类型字段 IP数据报：0x0800 Novell IPX：0x8137 第四个字段：长度在46到1500字节之间的数据字段 第五个字段：4字节的帧检验序列FCS（使用CRC检验） 扩展的以太网 使用集线器在物理层扩展以太网 交换式集线器常称为以太网交换机或第二层交换机（工作在数据链路层）。他就是一个多接口的网桥，而每个接口都直接与某台主机或另一个集线器相连，且工作在全双工方式。以太网交换机能同时连通许多对的接口，使每一对相互通信的主机都能像独占通信媒体那样，无碰撞地传输数据 XMind: ZEN - Trial Version","categories":[],"tags":[]},{"title":"我的博客诞生了","slug":"my-first-blog","date":"2020-03-06T14:23:32.565Z","updated":"2020-03-06T14:23:32.565Z","comments":true,"path":"2020/ckcl684ze00085j9kdsj068wv/","link":"","permalink":"https://shen-yu.gitee.io/2020/ckcl684ze00085j9kdsj068wv/","excerpt":"","text":"环境配置 macbook pro 2019 前期准备下载并安装 git node.js tips：如果下载速度过慢，可以找下国内镜像仓库npm的国内镜像https://npm.taobao.org/mirrors/上面这个网址里也有git的资源 安装hexo$ npm install -g hexo-cli github仓库建立仓库名必须满足：&lt;用户名&gt;.github.io github pages部署 安装hexo-deployer-gitnpm install hexo-deployer-git 修改配置文件_config.yml1234delpoy: type: git repo: https:github.com&#x2F;&lt;用户名&gt;&#x2F;&lt;用户名&gt;.github.io branch:gh-pages 运行hexo clean &amp;&amp; hexo deploy 查看你的github网站是否更改","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2020-03-06T10:01:43.506Z","updated":"2020-03-06T10:01:43.506Z","comments":true,"path":"2020/ckcl684z400005j9k040r2v74/","link":"","permalink":"https://shen-yu.gitee.io/2020/ckcl684z400005j9k040r2v74/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}